
# Hangman Game in C （我的第一个课外个人项目）

## 体会
+ 虽然说这是很简单的项目，但在这之前还是反反复复犹豫了好久才做决定写这个项目，
之前总是觉得没什么必要没什么意义。现在做完了发现，还是有意义的。至少我敲代码的同时发现了好多问题
+ 由于比较简单，我看了下思路决定自己复现，哪怕自己的代码跟答案迥乎不同。

## 问题
+ 没有区分大小写 & 输入非法字符，缺失检测输入的关键环节，直接 scanf("%c",&ch); 拿到回车、数字、符号都算一次猜测。
  怎么验证输入的只是字母呢，两种方法：
  + `if((ch >= 'A' && ch <= 'Z') || (ch >= 'a' && ch <= 'z'))`
  + `#include<ctype.h> isalpha()`
+ 没有初始化显示区
第一次进入循环前，玩家完全不知道单词有多长。
→ 信息不完整。
+ 你用 i 当“当前要猜第几个字母”，玩家必须按顺序一个一个猜对才算数。
标准 Hangman 是“任意顺序猜字母，猜中就显示所有该字母的位置”。
+ 怎么将数组全部初始化为0，两种方法：
  +   `memset(arr, 0, sizeof(arr));`
  +   `int arr[5] = {0};`话说我为什么这样搞失败了？查了一下，发现`int len = 100;
int isGuessed[len] = {0};  // 错误！len 不是 const`
这在 C99 之前是非法的，即使 C99 支持变长数组（VLA，VLA意味着数组大小是变量），也不能用 VLA 做静态初始化！
变长数组（VLA）不允许用 {0} 整体初始化，只能一个个赋值。
